docs/state_machines/dot/en/core/state_Request_for_accessing_the_cluster.dot
digraph {
  rankdir=LR;
  node [shape=oval];
  edge [fontsize=10];

  pending [label="Pending"];
  active [label="Confirmed"];
  closed [label="Closed"];
  __initial [shape=point];
  __initial -> pending;
  pending -> active [label="Approve"];
  pending -> closed [label="Reject"];
}
